Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotDuplicateType Property
 Cannot Duplicate Type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotDuplicateType { get; }
Visual Basic
Public Shared ReadOnly Property CannotDuplicateType As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotDuplicateType {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace